{
    "recipes":
    [
        {
            "recipeId":0,
            "userId":0,
            "title":"lotus Cheesecake",
            "ingredients":
            [
                {
                    "name":"Butter",
                    "amount":"125g"
                },
                {
                    "name":"Lotus biscuits",
                    "amount":"300g"
                }
            ],
            "method":
            [
                "Blitz the biscuits for the base in a food processor until they're a fine crumb. Mix with the melted butter and press down firmly into an 8inch/20cm Deep Springform Tin.",
                "With an electric mixer (I use my KitchenAid) Mix the cream cheese, vanilla, icing sugar and Biscoff Spread until smooth.",
                "Mix in the double cream and whisk until its thick and holds itself completely! (Don't whip it too fast, slow and steady wins the race). Alternatively, you can whip the cream separately to stiff peaks and fold through!",
                "Spread the mixture evenly over the biscuit base and chill in the fridge for at least 5-6 hours, but preferably overnight.",
                "Remove from the tin and decorate how you like.",
                "I whipped together the double cream and icing sugar and piped it on, adding a biscoff biscuit per slice and drizzled over some melted biscoff!"
            ],
            "categories":
            [
                "1",
                "2"
            ]
        },
        {
            "recipeId":1,
            "userId":0,
            "title":"Souffle Pancakes",
            "ingredients":
            [
                {
                    "name":"Large eggs",
                    "amount":"2"
                },
                {
                    "name":"Golden caster sugar",
                    "amount":"2tbs"
                },
                {
                    "name":"Vanilla extract",
                    "amount":"1tsp"
                },
                {
                    "name":"Milk",
                    "amount":"2tbs"
                },
                {
                    "name":"Self-raising flour",
                    "amount":"2tbs"
                },
                {
                    "name":"Vegetable oil",
                    "amount":"1tsp"
                }

                
            ],
            "method":
            [
                "Whisk the egg whites in a clean bowl with 1 tbsp sugar using an electric whisk or a stand mixer to form stiff peaks.",
                "Beat the egg yolks, 1 tbsp sugar and vanilla together in a separate bowl until pale and foamy, and a ribbon trail is left on the surface when the beaters are removed. Gently fold in the milk and flour until just incorporated.",
                "Fold the egg whites into the egg yolk mixture and gently turn the batter over to mix, using the side of a metal spoon or spatula to keep all the air in the mixture.",
                "Working fairly quickly, heat a large non-stick frying pan with a lid over a very low heat. Drizzle a little oil into the pan, then wipe it with a piece of kitchen paper – you only want a small film on the base of the pan. Make three tall pancakes by piling three spoonfuls of the batter into the pan, using about two thirds of the mixture. Keep them piled quite high, don’t tip the pan or spread them out like you would normal pancakes. Cover with a lid and cook for 2-4 mins, the steam will help them set. Remove the lid and add another dollop of batter to each pancake, this will create the classic height and thickness. Return the lid and cook for another 4-6 mins until the top feels slightly set.",
                "Very gently, and carefully, turn the pancakes over in the pan with a fish slice or spatula. The bases should be a light golden brown. Add the lid back on and cook for another 4-6 mins until both sides are golden brown and they have a slight wobble, but are not collapsing or sticky. Serve with a pat of butter, a dusting of icing sugar and a little maple syrup."
            ],
            "categories":
            [
                "7",
                "2"
            ]
        },
        {
            "recipeId":2,
            "userId":0,
            "title":"Broccoli and sausage pasta bake",
            "ingredients":
            [
                {
                    "name":"Large eggs",
                    "amount":"2"
                }
            ],
            "method":
            [
                "Whisk the egg whites in a clean bowl with 1 tbsp sugar using an electric whisk or a stand mixer to form stiff peaks.",
                "Beat the egg yolks, 1 tbsp sugar and vanilla together in a separate bowl until pale and foamy, and a ribbon trail is left on the surface when the beaters are removed. Gently fold in the milk and flour until just incorporated.",
                "Fold the egg whites into the egg yolk mixture and gently turn the batter over to mix, using the side of a metal spoon or spatula to keep all the air in the mixture.",
                "Working fairly quickly, heat a large non-stick frying pan with a lid over a very low heat. Drizzle a little oil into the pan, then wipe it with a piece of kitchen paper – you only want a small film on the base of the pan. Make three tall pancakes by piling three spoonfuls of the batter into the pan, using about two thirds of the mixture. Keep them piled quite high, don’t tip the pan or spread them out like you would normal pancakes. Cover with a lid and cook for 2-4 mins, the steam will help them set. Remove the lid and add another dollop of batter to each pancake, this will create the classic height and thickness. Return the lid and cook for another 4-6 mins until the top feels slightly set.",
                "Very gently, and carefully, turn the pancakes over in the pan with a fish slice or spatula. The bases should be a light golden brown. Add the lid back on and cook for another 4-6 mins until both sides are golden brown and they have a slight wobble, but are not collapsing or sticky. Serve with a pat of butter, a dusting of icing sugar and a little maple syrup."
            ],
            "categories":
            [
                "2",
                "4"
            ]
        },
            {
            "recipeId":3,
            "userId":0,
            "title":"Rocky Road",
            "ingredients":[
                {
                    "name":"Digestive biscuits",
                    "amount":"200g"
                },
                {
                    "name":"Butter",
                    "amount":"135g"
                },
                {
                    "name":"Dark chocolate",
                    "amount":"200g"
                },
                {
                    "name":"Syrup",
                    "amount":"2.5tbs"
                },
                {
                    "name":"Mini marshmallows",
                    "amount":"100g"
                }
            ],
            "method":[
                "Grease and line an 18cm square brownie tin with baking paper.",
                "Place 200g digestive biscuits in a freezer bag and bash with a rolling pin or just the side of your fist until they're broken into a mixture of everything between dust and 50p-sized lumps. Set aside.",
                "In a large saucepan melt 135g butter or margarine, 200g dark chocolate and 2-3 tbsp golden syrup over a gentle heat stirring constantly until there are no or almost no more lumps of chocolate visible, then remove from the heat. Leave to cool.",
                "Take the biscuits, 100g mini marshmallows and up to 100g of additional ingredients (dried fruit, nuts, popcorn, honeycomb), if you like, and stir into the chocolate mixture until everything is completely covered.",
                "Tip the mixture into the lined baking tin, and spread it out to the corners. Chill for at least 2 hrs then dust with icing sugar and cut into 12 fingers."
            ],
            "categories":[
                "1",
                "2"
            ]
	    },
		{
            "recipeId":4,
            "userId":0,
            "title":"Chocolate Molten Cakes",
            "ingredients":[
                {
                    "name":"Large eggs",
                    "amount":"3"
                },
                {
                    "name":"Butter",
                    "amount":"100g"
                },
                {
                    "name":"Dark chocolate",
                    "amount":"100g"
                },
                {
                    "name":"Light brown soft sugar",
                    "amount":"150g"
                },
                {
                    "name":"Vanilla extract",
                    "amount":"1.5tsp"
                },
		        {
                    "name":"Plain flour",
                    "amount":"50g"
                }
            ],
            "method":[
                "Heat oven to 200C/180C fan/gas 6. Butter 6 dariole moulds or basins well and place on a baking tray.",
                "Put 100g butter and 100g chopped dark chocolate in a heatproof bowl and set over a pan of hot water (or alternatively put in the microwave and melt in 30 second bursts on a low setting) and stir until smooth. Set aside to cool slightly for 15 mins.",
		        "Using an electric hand whisk, mix in 150g light brown soft sugar, then 3 large eggs, one at a time, followed by ½ tsp vanilla extract and finally 50g plain flour. Divide the mixture among the darioles or basins.",
		        "You can now either put the mixture in the fridge, or freezer until you're ready to bake them. Can be cooked straight from frozen for 16 mins, or bake now for 10-12 mins until the tops are firm to the touch but the middles still feel squidgy.",
		        "Carefully run a knife around the edge of each pudding, then turn out onto serving plates"
            ],
            "categories":[
                "1",
                "2"
            ]
	    },
		{
            "recipeId":5,
            "userId":0,
            "title":"Spaghetti with Nduja, fennel & olives",
            "ingredients":[
                {
                    "name":"Spaghetti",
                    "amount":"400g"
                },
                {
                    "name":"Garlic cloves",
                    "amount":"3"
                },
                {
                    "name":"Fennel",
                    "amount":"0.5"
                },
                {
                    "name":"Nduja or Sobrasada paste",
                    "amount":"75g"
                },
                {
                    "name":"Tomatoes",
                    "amount":"200g"
                },
		        {
                    "name":"Black olives",
                    "amount":"75g"
                },
		        {
                    "name":"Olive oil",
                    "amount":"3tbs"
                },
		        {
                    "name":"Tomato purée",
                    "amount":"2tbs"
                },
		        {
                    "name":"Red wine vinegar",
                    "amount":"2tbs"
                },
		        {
                    "name":"Pecorino",
                    "amount":"40g"
                }
            ],
            "method":[
                "Boil the kettle. Put all the ingredients except the pecorino and basil in a wide saucepan or deep frying pan and season well. Pour over 800ml kettle-hot water and bring to a simmer, using your tongs to ease the spaghetti under the liquid as it starts to soften.",
		        "Simmer, uncovered, for 10-12 mins, tossing the spaghetti through the liquid every so often until it is cooked and the sauce is reduced and clinging to it. Add a splash more hot water if the sauce is too thick or does not cover the pasta while it cooks. Turn up the heat for the final few mins to drive off the excess liquid, leaving you with a rich sauce. Stir through the pecorino and basil, and serve with an extra drizzle of oil and pecorino on the side."
            ],
            "categories":[
                "1",
                "2"
            ]
	    },
        {
            "recipeId":6,
            "userId":0,
            "title":"Peanut butter & Jam flapjack",
            "ingredients":[
                {
                    "name":"Salted butter",
                    "amount":"5tbs"
                },
                {
                    "name":"Peanut butter",
                    "amount":"250g"
                },
                {
                    "name":"Jam",
                    "amount":"8tbs"
                },
                {
                    "name":"Light brown soft sugar",
                    "amount":"80g"
                },
                {
                    "name":"Rolled oats",
                    "amount":"200g"
                }
            ],
            "method":[
                "Heat the oven to 180C/160C fan/gas 4. Butter and line the base and sides of a 20cm square cake tin with baking parchment.",
                "Put 3 tbsp each of the peanut butter and jam in separate small bowls and set aside. Tip the remaining peanut butter, the rest of the jam and the butter and sugar into a pan set over a medium heat and stir until everything has melted together. Quickly stir in the oats, then leave to cool for 5 mins.",
                "Spoon the mixture into the prepared cake tin and gently press down with your hands. Dot over the reserved peanut butter and jam, then bake for 20-25 mins or until golden brown. Leave to cool completely in the tin, then turn out onto a board and cut into squares."
            ],
            "categories":[
                "1",
                "2"
            ]
	    },
        {
            "recipeId":7,
            "userId":0,
            "title":"Smoked salmon & Spinach gratin",
            "ingredients":[
                {
                    "name":"Butter",
                    "amount":"15g"
                },
                {
                    "name":"Smoked raw salmon fillets",
                    "amount":"6"
                },
                {
                    "name":"Spinach",
                    "amount":"1200g"
                },
                {
                    "name":"Double cream",
                    "amount":"300ml"
                }
            ],
            "method":[
                "Put the spinach in a really big saucepan (or two saucepans) and add a few tablespoons of water. Cover, set over a medium heat and cook for about 5-8 mins, turning the spinach over every so often, until wilted. Tip it into a colander to drain and allow it to cool (spread it out on a plate to cool it quicker). Take big handfuls of it in your fists and squeeze out the excess water. It’s really important that you do this, otherwise the water will leach out and make the cream watery and green.",
                "Chop the spinach. Melt the butter in a saucepan and gently toss the spinach in it. Season with pepper and a tiny bit of salt (there’s so much salt in the salmon). Heat the oven to 160C/140C fan/gas 3. Lay the spinach in the bottom of a gratin dish (about 30cm x 20cm), then arrange the salmon fillets on top.",
                "Heat the double cream in a small pan, then pour it all over the salmon and spinach. Bake for 35 mins, or until the top is golden and the cream is bubbling."
            ],
            "categories":[
                "1",
                "2"
            ]
	    },
        {
            "recipeId":8,
            "userId":0,
            "title":"Chorizo & pea risotto",
            "ingredients":[
                {
                    "name":"Oil",
                    "amount":"1tbs"
                },
                {
                    "name":"Chorizo",
                    "amount":"200g"
                },
                {
                    "name":"Risotto rice",
                    "amount":"300g"
                },
                {
                    "name":"Vinegar",
                    "amount":"2tbs"
                },
                {
                    "name":"Chicken stock",
                    "amount":"1200ml"
                },
                {
                    "name":"Pea",
                    "amount":"200g"
                },
                {
                    "name":"Parmesan",
                    "amount":"60g"
                }
            ],
            "method":[
                "Heat the oil in a large frying pan, tip in the chorizo and fry until it is crisp and all the oil has been released. Remove a quarter of the chorizo with a slotted spoon and set aside.",
                "Tip the rice into the pan, stir to coat it in the oil and toast for a min or so, then pour in the vinegar. Once the vinegar has evaporated, add a ladleful of the stock, stir then, once absorbed, add a bit more. Continue doing this for about 20 mins until most of the stock has been absorbed and the rice has swollen but still has a slight bite.",
                "Tip in the peas, parmesan and the remaining stock. Give everything a good stir. Once the cheese has melted, season with black pepper, then divide between bowls, topping each portion with the remaining crisp chorizo and extra grated parmesan."
            ],
            "categories":[
                "1",
                "2"
            ]
	    },
        {
            "recipeId":9,
            "userId":0,
            "title":"Red Pepper linguine",
            "ingredients":[
                {
                    "name":"Red pepper",
                    "amount":"1"
                },
                {
                    "name":"Garlic cloves",
                    "amount":"1"
                },
                {
                    "name":"Olive oil",
                    "amount":"30ml"
                },
                {
                    "name":"Walnuts",
                    "amount":"50g"
                },
                {
                    "name":"Linguine",
                    "amount":"100g"
                },
                {
                    "name":"Parmesan",
                    "amount":"10g"
                }
            ],
            "method":[
                "Blitz the roasted red pepper with the olive oil, walnuts and garlic in a food processor, season well and set aside.",
                "Bring a pan of salted water to the boil, add the pasta and cook for 1 min less than the pack instructions and drain, reserving a ladleful of cooking water. Tip the pasta back into the pan, along with the reserved cooking water and red pepper sauce, and return to the heat to warm through. Tip the pasta into a bowl and top with the parmesan and some chopped toasted walnuts. Season and serve."
            ],
            "categories":[
                "1",
                "2"
            ]
	    },
        {
            "recipeId":10,
            "userId":0,
            "title":"Red pepper linguine",
            "ingredients":[
                {
                    "name":"Potatoes",
                    "amount":"3"
                },
                {
                    "name":"Olive oil",
                    "amount":"5ml"
                },
                {
                    "name":"Pork sausages",
                    "amount":"4"
                },
                {
                    "name":"Cherry tomatoes",
                    "amount":"200g"
                },
                {
                    "name":"Fresh pesto",
                    "amount":"65g"
                }
            ],
            "method":[
                "Peel and quarter the potatoes, then cook in a large pan of salted, boiling water for 15 mins. Drain and set aside.",
                "Pour a glug of olive oil into a large frying pan over a medium heat and cook the sausages for 15 mins. Add the tomatoes to the pan for the final 5 mins. Mash the potatoes well and mix in the pesto. Season and serve with the sausages and tomatoes."
            ],
            "categories":[
                "1",
                "2"
            ]
	    }
    ]
}
